==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [120, 1]                  --
├─Linear: 1-1                            [120, 128]                38,528
├─BatchNorm1d: 1-2                       [120, 128]                256
├─ReLU: 1-3                              [120, 128]                --
├─Dropout: 1-4                           [120, 128]                --
├─Linear: 1-5                            [120, 1]                  129
==========================================================================================
Total params: 38,913
Trainable params: 38,913
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 4.67
==========================================================================================
Input size (MB): 0.14
Forward/backward pass size (MB): 0.25
Params size (MB): 0.16
Estimated Total Size (MB): 0.55
==========================================================================================