==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [256, 1]                  --
├─Linear: 1-1                            [256, 13, 32]             64
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [256, 13, 32]             --
│    │    └─MultiHeadAttention: 3-1      [256, 13, 32]             4,288
│    │    └─FFN: 3-2                     [256, 13, 32]             33,376
│    └─TransformerBlock: 2-2             [256, 13, 32]             --
│    │    └─MultiHeadAttention: 3-3      [256, 13, 32]             4,288
│    │    └─FFN: 3-4                     [256, 13, 32]             33,376
│    └─TransformerBlock: 2-3             [256, 13, 32]             --
│    │    └─MultiHeadAttention: 3-5      [256, 13, 32]             4,288
│    │    └─FFN: 3-6                     [256, 13, 32]             33,376
│    └─TransformerBlock: 2-4             [256, 13, 32]             --
│    │    └─MultiHeadAttention: 3-7      [256, 13, 32]             4,288
│    │    └─FFN: 3-8                     [256, 13, 32]             33,376
├─Linear: 1-3                            [256, 1]                  33
==========================================================================================
Total params: 150,753
Trainable params: 150,753
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 38.59
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 79.24
Params size (MB): 0.60
Estimated Total Size (MB): 79.85
==========================================================================================