==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [120, 1]                  --
├─Linear: 1-1                            [120, 32]                 9,632
├─BatchNorm1d: 1-2                       [120, 32]                 64
├─ReLU: 1-3                              [120, 32]                 --
├─Dropout: 1-4                           [120, 32]                 --
├─Linear: 1-5                            [120, 1]                  33
==========================================================================================
Total params: 9,729
Trainable params: 9,729
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 1.17
==========================================================================================
Input size (MB): 0.14
Forward/backward pass size (MB): 0.06
Params size (MB): 0.04
Estimated Total Size (MB): 0.25
==========================================================================================