==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 128]           131,200
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 128]           66,304
│    │    └─FFN: 3-2                     [108, 300, 128]           526,720
│    └─TransformerBlock: 2-2             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 128]           66,304
│    │    └─FFN: 3-4                     [108, 300, 128]           526,720
│    └─TransformerBlock: 2-3             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 128]           66,304
│    │    └─FFN: 3-6                     [108, 300, 128]           526,720
│    └─TransformerBlock: 2-4             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-7      [108, 300, 128]           66,304
│    │    └─FFN: 3-8                     [108, 300, 128]           526,720
├─Linear: 1-3                            [108, 1]                  38,401
==========================================================================================
Total params: 2,541,697
Trainable params: 2,541,697
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 274.50
==========================================================================================
Input size (MB): 132.71
Forward/backward pass size (MB): 3085.52
Params size (MB): 10.17
Estimated Total Size (MB): 3228.39
==========================================================================================