==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 32]            24,608
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 32]            --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 32]            4,288
│    │    └─FFN: 3-2                     [108, 300, 32]            33,376
│    └─TransformerBlock: 2-2             [108, 300, 32]            --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 32]            4,288
│    │    └─FFN: 3-4                     [108, 300, 32]            33,376
│    └─TransformerBlock: 2-3             [108, 300, 32]            --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 32]            4,288
│    │    └─FFN: 3-6                     [108, 300, 32]            33,376
├─Linear: 1-3                            [108, 1]                  9,601
==========================================================================================
Total params: 147,201
Trainable params: 147,201
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 15.90
==========================================================================================
Input size (MB): 99.53
Forward/backward pass size (MB): 580.61
Params size (MB): 0.59
Estimated Total Size (MB): 680.73
==========================================================================================