==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNNModel                                 [128, 2]                  --
├─Conv1d: 1-1                            [128, 64, 13]             256
├─BatchNorm1d: 1-2                       [128, 64, 13]             128
├─ReLU: 1-3                              [128, 64, 13]             --
├─MaxPool1d: 1-4                         [128, 64, 6]              --
├─Conv1d: 1-5                            [128, 128, 6]             24,704
├─BatchNorm1d: 1-6                       [128, 128, 6]             256
├─ReLU: 1-7                              [128, 128, 6]             --
├─MaxPool1d: 1-8                         [128, 128, 3]             --
├─Conv1d: 1-9                            [128, 256, 3]             98,560
├─BatchNorm1d: 1-10                      [128, 256, 3]             512
├─ReLU: 1-11                             [128, 256, 3]             --
├─AdaptiveAvgPool1d: 1-12                [128, 256, 1]             --
├─Linear: 1-13                           [128, 256]                65,792
├─ReLU: 1-14                             [128, 256]                --
├─Dropout: 1-15                          [128, 256]                --
├─Linear: 1-16                           [128, 2]                  514
==========================================================================================
Total params: 190,722
Trainable params: 190,722
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 65.85
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 5.11
Params size (MB): 0.76
Estimated Total Size (MB): 5.88
==========================================================================================