==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNNModel                                 [128, 2]                  --
├─Conv1d: 1-1                            [128, 32, 13]             128
├─BatchNorm1d: 1-2                       [128, 32, 13]             64
├─ReLU: 1-3                              [128, 32, 13]             --
├─MaxPool1d: 1-4                         [128, 32, 6]              --
├─Conv1d: 1-5                            [128, 64, 6]              6,208
├─BatchNorm1d: 1-6                       [128, 64, 6]              128
├─ReLU: 1-7                              [128, 64, 6]              --
├─MaxPool1d: 1-8                         [128, 64, 3]              --
├─Conv1d: 1-9                            [128, 128, 3]             24,704
├─BatchNorm1d: 1-10                      [128, 128, 3]             256
├─ReLU: 1-11                             [128, 128, 3]             --
├─AdaptiveAvgPool1d: 1-12                [128, 128, 1]             --
├─Linear: 1-13                           [128, 128]                16,512
├─ReLU: 1-14                             [128, 128]                --
├─Dropout: 1-15                          [128, 128]                --
├─Linear: 1-16                           [128, 2]                  258
==========================================================================================
Total params: 48,258
Trainable params: 48,258
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 16.67
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 2.56
Params size (MB): 0.19
Estimated Total Size (MB): 2.76
==========================================================================================