==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN                                      [512, 2]                  --
├─Conv1d: 1-1                            [512, 128, 1]             5,504
├─BatchNorm1d: 1-2                       [512, 128, 1]             256
├─ReLU: 1-3                              [512, 128, 1]             --
├─AdaptiveMaxPool1d: 1-4                 [512, 128, 8]             --
├─Conv1d: 1-5                            [512, 256, 8]             98,560
├─BatchNorm1d: 1-6                       [512, 256, 8]             512
├─ReLU: 1-7                              [512, 256, 8]             --
├─AdaptiveMaxPool1d: 1-8                 [512, 256, 8]             --
├─Conv1d: 1-9                            [512, 512, 8]             393,728
├─BatchNorm1d: 1-10                      [512, 512, 8]             1,024
├─ReLU: 1-11                             [512, 512, 8]             --
├─AdaptiveAvgPool1d: 1-12                [512, 512, 1]             --
├─Linear: 1-13                           [512, 128]                65,664
├─ReLU: 1-14                             [512, 128]                --
├─Dropout: 1-15                          [512, 128]                --
├─Linear: 1-16                           [512, 2]                  258
==========================================================================================
Total params: 565,506
Trainable params: 565,506
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 2.05
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 51.91
Params size (MB): 2.26
Estimated Total Size (MB): 54.20
==========================================================================================