==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTM                                     [256, 2]                  --
├─LSTM: 1-1                              [256, 129, 128]           67,072
├─LayerNorm: 1-2                         [256, 129, 128]           256
├─Dropout: 1-3                           [256, 129, 128]           --
├─Linear: 1-4                            [256, 2]                  258
==========================================================================================
Total params: 67,586
Trainable params: 67,586
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 2.22
==========================================================================================
Input size (MB): 0.13
Forward/backward pass size (MB): 67.64
Params size (MB): 0.27
Estimated Total Size (MB): 68.04
==========================================================================================