==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTMModel                                [256, 1]                  --
├─LSTM: 1-1                              [256, 13, 128]            67,072
├─LayerNorm: 1-2                         [256, 13, 128]            256
├─Dropout: 1-3                           [256, 13, 128]            --
├─Linear: 1-4                            [256, 1]                  129
==========================================================================================
Total params: 67,457
Trainable params: 67,457
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 223.31
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 6.82
Params size (MB): 0.27
Estimated Total Size (MB): 7.10
==========================================================================================