==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 128]           98,432
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 128]           66,304
│    │    └─FFN: 3-2                     [108, 300, 128]           526,720
│    └─TransformerBlock: 2-2             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 128]           66,304
│    │    └─FFN: 3-4                     [108, 300, 128]           526,720
│    └─TransformerBlock: 2-3             [108, 300, 128]           --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 128]           66,304
│    │    └─FFN: 3-6                     [108, 300, 128]           526,720
├─Linear: 1-3                            [108, 1]                  129
==========================================================================================
Total params: 1,877,633
Trainable params: 1,877,633
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 202.78
==========================================================================================
Input size (MB): 99.53
Forward/backward pass size (MB): 2322.43
Params size (MB): 7.51
Estimated Total Size (MB): 2429.48
==========================================================================================