==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [120, 1]                  --
├─Linear: 1-1                            [120, 16]                 4,816
├─BatchNorm1d: 1-2                       [120, 16]                 32
├─ReLU: 1-3                              [120, 16]                 --
├─Dropout: 1-4                           [120, 16]                 --
├─Linear: 1-5                            [120, 1]                  17
==========================================================================================
Total params: 4,865
Trainable params: 4,865
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.58
==========================================================================================
Input size (MB): 0.14
Forward/backward pass size (MB): 0.03
Params size (MB): 0.02
Estimated Total Size (MB): 0.20
==========================================================================================