==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLP                                      [1, 2]                    --
├─Linear: 1-1                            [1, 128]                  16,934,528
├─BatchNorm1d: 1-2                       [1, 128]                  256
├─ReLU: 1-3                              [1, 128]                  --
├─Dropout: 1-4                           [1, 128]                  --
├─Linear: 1-5                            [1, 2]                    258
==========================================================================================
Total params: 16,935,042
Trainable params: 16,935,042
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 16.94
==========================================================================================
Input size (MB): 0.53
Forward/backward pass size (MB): 0.00
Params size (MB): 67.74
Estimated Total Size (MB): 68.27
==========================================================================================