==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLP                                      [128, 2]                  --
├─Linear: 1-1                            [128, 128]                16,640
├─BatchNorm1d: 1-2                       [128, 128]                256
├─ReLU: 1-3                              [128, 128]                --
├─Dropout: 1-4                           [128, 128]                --
├─Linear: 1-5                            [128, 2]                  258
==========================================================================================
Total params: 17,154
Trainable params: 17,154
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 2.20
==========================================================================================
Input size (MB): 0.07
Forward/backward pass size (MB): 0.26
Params size (MB): 0.07
Estimated Total Size (MB): 0.40
==========================================================================================