==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNNModel                                 [256, 1]                  --
├─Conv1d: 1-1                            [256, 64, 11]             256
├─MaxPool1d: 1-2                         [256, 64, 5]              --
├─Dropout: 1-3                           [256, 64, 5]              --
├─Conv1d: 1-4                            [256, 128, 3]             24,704
├─MaxPool1d: 1-5                         [256, 128, 1]             --
├─Dropout: 1-6                           [256, 128, 1]             --
├─Linear: 1-7                            [256, 128]                16,512
├─Dropout: 1-8                           [256, 128]                --
├─Linear: 1-9                            [256, 1]                  129
==========================================================================================
Total params: 41,601
Trainable params: 41,601
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 23.95
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 2.49
Params size (MB): 0.17
Estimated Total Size (MB): 2.67
==========================================================================================