==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTMModel                              [256, 1]                  --
├─LSTM: 1-1                              [256, 13, 256]            134,144
├─LayerNorm: 1-2                         [256, 13, 256]            512
├─Dropout: 1-3                           [256, 13, 256]            --
├─Linear: 1-4                            [256, 1]                  257
==========================================================================================
Total params: 134,913
Trainable params: 134,913
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 446.63
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 13.63
Params size (MB): 0.54
Estimated Total Size (MB): 14.19
==========================================================================================