==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTM                                   [256, 2]                  --
├─LSTM: 1-1                              [256, 129, 512]           530,432
├─LayerNorm: 1-2                         [256, 129, 512]           1,024
├─Dropout: 1-3                           [256, 129, 512]           --
├─Linear: 1-4                            [256, 2]                  1,026
==========================================================================================
Total params: 532,482
Trainable params: 532,482
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 17.52
==========================================================================================
Input size (MB): 0.13
Forward/backward pass size (MB): 270.54
Params size (MB): 2.13
Estimated Total Size (MB): 272.80
==========================================================================================