==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTM                                   [256, 2]                  --
├─LSTM: 1-1                              [256, 129, 256]           134,144
├─LayerNorm: 1-2                         [256, 129, 256]           512
├─Dropout: 1-3                           [256, 129, 256]           --
├─Linear: 1-4                            [256, 2]                  514
==========================================================================================
Total params: 135,170
Trainable params: 135,170
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 4.43
==========================================================================================
Input size (MB): 0.13
Forward/backward pass size (MB): 135.27
Params size (MB): 0.54
Estimated Total Size (MB): 135.94
==========================================================================================