==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 16]            16,400
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 16]            1,120
│    │    └─FFN: 3-2                     [108, 300, 16]            8,496
│    └─TransformerBlock: 2-2             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 16]            1,120
│    │    └─FFN: 3-4                     [108, 300, 16]            8,496
│    └─TransformerBlock: 2-3             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 16]            1,120
│    │    └─FFN: 3-6                     [108, 300, 16]            8,496
│    └─TransformerBlock: 2-4             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-7      [108, 300, 16]            1,120
│    │    └─FFN: 3-8                     [108, 300, 16]            8,496
├─Linear: 1-3                            [108, 1]                  4,801
==========================================================================================
Total params: 59,665
Trainable params: 59,665
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 6.44
==========================================================================================
Input size (MB): 132.71
Forward/backward pass size (MB): 385.69
Params size (MB): 0.24
Estimated Total Size (MB): 518.64
==========================================================================================