==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN                                      [128, 2]                  --
├─Conv1d: 1-1                            [128, 128, 129]           512
├─BatchNorm1d: 1-2                       [128, 128, 129]           256
├─ReLU: 1-3                              [128, 128, 129]           --
├─AdaptiveMaxPool1d: 1-4                 [128, 128, 8]             --
├─Conv1d: 1-5                            [128, 256, 8]             98,560
├─BatchNorm1d: 1-6                       [128, 256, 8]             512
├─ReLU: 1-7                              [128, 256, 8]             --
├─AdaptiveMaxPool1d: 1-8                 [128, 256, 8]             --
├─Conv1d: 1-9                            [128, 512, 8]             393,728
├─BatchNorm1d: 1-10                      [128, 512, 8]             1,024
├─ReLU: 1-11                             [128, 512, 8]             --
├─AdaptiveAvgPool1d: 1-12                [128, 512, 1]             --
├─Linear: 1-13                           [128, 512]                262,656
├─ReLU: 1-14                             [128, 512]                --
├─Dropout: 1-15                          [128, 512]                --
├─Linear: 1-16                           [128, 2]                  1,026
==========================================================================================
Total params: 758,274
Trainable params: 758,274
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 546.54
==========================================================================================
Input size (MB): 0.07
Forward/backward pass size (MB): 46.93
Params size (MB): 3.03
Estimated Total Size (MB): 50.03
==========================================================================================