==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN                                      [256, 2]                  --
├─Conv1d: 1-1                            [256, 128, 129]           512
├─BatchNorm1d: 1-2                       [256, 128, 129]           256
├─ReLU: 1-3                              [256, 128, 129]           --
├─MaxPool1d: 1-4                         [256, 128, 64]            --
├─Conv1d: 1-5                            [256, 256, 64]            98,560
├─BatchNorm1d: 1-6                       [256, 256, 64]            512
├─ReLU: 1-7                              [256, 256, 64]            --
├─MaxPool1d: 1-8                         [256, 256, 32]            --
├─Conv1d: 1-9                            [256, 512, 32]            393,728
├─BatchNorm1d: 1-10                      [256, 512, 32]            1,024
├─ReLU: 1-11                             [256, 512, 32]            --
├─AdaptiveAvgPool1d: 1-12                [256, 512, 1]             --
├─Linear: 1-13                           [256, 512]                262,656
├─ReLU: 1-14                             [256, 512]                --
├─Dropout: 1-15                          [256, 512]                --
├─Linear: 1-16                           [256, 2]                  1,026
==========================================================================================
Total params: 758,274
Trainable params: 758,274
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 4.93
==========================================================================================
Input size (MB): 0.13
Forward/backward pass size (MB): 202.90
Params size (MB): 3.03
Estimated Total Size (MB): 206.07
==========================================================================================