==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [256, 2]                  --
├─Linear: 1-1                            [256, 13, 128]            256
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [256, 13, 128]            --
│    │    └─MultiHeadAttention: 3-1      [256, 13, 128]            66,304
│    │    └─FFN: 3-2                     [256, 13, 128]            526,720
│    └─TransformerBlock: 2-2             [256, 13, 128]            --
│    │    └─MultiHeadAttention: 3-3      [256, 13, 128]            66,304
│    │    └─FFN: 3-4                     [256, 13, 128]            526,720
│    └─TransformerBlock: 2-3             [256, 13, 128]            --
│    │    └─MultiHeadAttention: 3-5      [256, 13, 128]            66,304
│    │    └─FFN: 3-6                     [256, 13, 128]            526,720
│    └─TransformerBlock: 2-4             [256, 13, 128]            --
│    │    └─MultiHeadAttention: 3-7      [256, 13, 128]            66,304
│    │    └─FFN: 3-8                     [256, 13, 128]            526,720
├─Linear: 1-3                            [256, 2]                  258
==========================================================================================
Total params: 2,372,610
Trainable params: 2,372,610
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 607.39
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 316.94
Params size (MB): 9.49
Estimated Total Size (MB): 326.44
==========================================================================================