==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 16]            12,304
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 16]            1,120
│    │    └─FFN: 3-2                     [108, 300, 16]            8,496
│    └─TransformerBlock: 2-2             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 16]            1,120
│    │    └─FFN: 3-4                     [108, 300, 16]            8,496
│    └─TransformerBlock: 2-3             [108, 300, 16]            --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 16]            1,120
│    │    └─FFN: 3-6                     [108, 300, 16]            8,496
├─Linear: 1-3                            [108, 1]                  4,801
==========================================================================================
Total params: 45,953
Trainable params: 45,953
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 4.96
==========================================================================================
Input size (MB): 99.53
Forward/backward pass size (MB): 290.30
Params size (MB): 0.18
Estimated Total Size (MB): 390.02
==========================================================================================