==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [108, 1]                  --
├─Linear: 1-1                            [108, 300, 8]             6,152
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [108, 300, 8]             --
│    │    └─MultiHeadAttention: 3-1      [108, 300, 8]             304
│    │    └─FFN: 3-2                     [108, 300, 8]             2,200
│    └─TransformerBlock: 2-2             [108, 300, 8]             --
│    │    └─MultiHeadAttention: 3-3      [108, 300, 8]             304
│    │    └─FFN: 3-4                     [108, 300, 8]             2,200
│    └─TransformerBlock: 2-3             [108, 300, 8]             --
│    │    └─MultiHeadAttention: 3-5      [108, 300, 8]             304
│    │    └─FFN: 3-6                     [108, 300, 8]             2,200
│    └─TransformerBlock: 2-4             [108, 300, 8]             --
│    │    └─MultiHeadAttention: 3-7      [108, 300, 8]             304
│    │    └─FFN: 3-8                     [108, 300, 8]             2,200
├─Linear: 1-3                            [108, 1]                  2,401
==========================================================================================
Total params: 18,569
Trainable params: 18,569
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 2.01
==========================================================================================
Input size (MB): 99.53
Forward/backward pass size (MB): 192.85
Params size (MB): 0.07
Estimated Total Size (MB): 292.45
==========================================================================================